# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'
tap 'shivammathur/extensions'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'bat'
brew 'exa'
brew 'duf'
brew 'ripgrep'
brew 'diff-so-fancy'
brew 'fx'
brew 'jq'
brew 'tldr'
brew 'glances'
brew 'procs'
brew 'dog'
brew 'glow'

# Development
brew 'postgresql'
brew 'redis'
brew 'nvm'
brew 'imagemagick'
brew 'shivammathur/php/php@8.2'
brew 'xdebug@8.2'
brew 'imagick@8.2'
brew 'redis@8.2'
brew 'swoole@8.2'
brew 'nginx'
brew 'dnsmasq'
brew 'awscli'
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'
brew 'rustup-init'

# Apps
cask 'charles'
cask 'docker'
cask 'google-chrome-canary'
cask 'imageoptim'
cask 'tableplus'
cask 'the-unarchiver'
cask 'paw'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Mac App Store